app/Models/UrlModel.php

    public function getAllUrls()
    {
        // Order by user_id, show the anonymous urls last
        $array = $this->asArray()
                    ->orderBy('user_id', 'ASC')
                    ->findAll();
---
SELECT *
FROM `url`
ORDER BY `user_id` ASC