app/Models/UserModel.php

SELECT *
FROM `auth_groups`
WHERE `name` = 'usuaris'
---
    public function withGroup(string $groupName)
    {
        $group = $this->db->table('auth_groups')->where('name', $groupName)->get()->getFirstRow();

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
---
    public function getAllUsers()
    {
        return $this->asArray()
                    ->findAll();

SELECT *
FROM `users`
WHERE `id` = '1'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    public function getUserById($id)
    {
        return $this->asArray()
                    ->where(['id' => $id])
                    ->first();

SELECT `auth_groups`.`name`
FROM `auth_groups_users`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
WHERE `auth_groups_users`.`user_id` = '1'
---
    public function getUserGroups($id)
    {
        return $this->db->table('auth_groups_users')
                        ->select('auth_groups.name')
                        ->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id')
                        ->where('auth_groups_users.user_id', $id)
                        ->get()
                        ->getResultArray();

UPDATE `users` SET `active` = 1, `updated_at` = '2023-04-24 14:19:43'
WHERE `users`.`id` IN ('2')
---
    public function activateUser($id)
    {
        return $this->update($id, ['active' => 1]);