app/Models/VisitModel.php

    public function countVisitsByRoute($route)
    {
        return $this->where('url_route', $route)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `visits`
WHERE `url_route` = '5264f1'